gibbs212521/HEC_2_senior_design/Firmware/MSP430fr5994_MCU/Includes/lcd.h
#ifndef HD44780_H_ // Don't touch
#define HD44780_H_ // Don't touch


#include "stdint.h" // Don't touch


// INFORMATION - please read this first:
//
// Version: 1.00 - Initial realease
// Date   : March 31, 2017
// Author : Dennis Eichmann
//
// This library offers an easy and flexible way to connect a HD44780 (or compatible) display to a microcontroller like the MSP430 or MSP432.
// Of course it can be used on other controllers as well - simply replace the controller specific denominations.
//
// NOTE: The display is used in write mode only, so R/W needs to be tied to GND.
//
// The library works timer based and uses a buffer that holds the display content. By calling a single function of this library inside a timer interrupt
// every 1 ms to 10 ms, the data will automatically be written from the buffer to the display. This ensures that there won't be any timing violations
// for the HD44780 controller, one of the most often seen issues when beginners start working with this popular type of display. This also applies to the
// initialization of the controller - if the timing is wrong during the initialization process, the display will never work as expected.
// A frequently seen workaround for timing issues are delay loops, often adjusted until it finally works, at least as long as the processor's clock frequency
// isn't changed. This timer based method eliminates these issues, regardless of the processor's clock speed and it removes the program blocking delay loops.
// Another benefit is the flexible hardware interface - the library supports the usual parallel connection to the microcontroller as well as a serialized
// interface via a 74HCT595 or 74HCT164 shift register, both as full eight bit or four bit nibble mode. In addition, all connections can be mixed up
// between different ports and the pins also do not need to be consecutive.
//
// But of course you do not only get advantages for free - the library adds some unnecessary overhead you normally could avoid when writing the code
// for one specific application on a given hardware setup. Some drawbacks are the data buffer, for example. For a 4x20 display, this requires 80 bytes of RAM
// already and the library needs some amount of non-volatile memory, of course. The timer will somehow keep the controller active, at least in intervals,
// so it is not the most power saving way. Keep in mind that the display is updated, regardless if the content has changed or not. The very flexible way of
// connecting the display to completely mixed up ports and pins adds some clock cycles for setting the outputs you would not have when writing a complete
// byte to a port for a display having D0 to D7 connected to Px.0 to Px.7 of the microcontroller. And although this library uses conditional compiling,
// depending on the selections made by the user, a tiny amount of extra processing might still be existing.
//
// These small drawbacks will be negligible for most users, but I wanted to mention them anyway.
//
// For questions, suggestions, error reports or any other problems, just contact me: https://e2e.ti.com/members/3534089
// Alternatively open a question or discussion on the TI E2E forum: https://e2e.ti.com/support/microcontrollers/msp430/
// The latest version, more information and some application examples can be found here: https://e2e.ti.com/group/launchyourdesign/m/msp430microcontrollerprojects
//
//
// HOW TO USE THIS LIBRARY:
// ------------------------
// Go through this hd44780.h file and make your selections in all boxes that are not grayed out by the IDE (at least CCS grays out non-relevant parts of code).
// Depending on your selection, not required parts are grayed out automatically. Therefore it is important to start at the top without skipping any required box.
// Once you have reached the end of the configuration, simply call the hd44780_timer_isr() inside a continuously running timer ISR that is executed every 1 ms to
// 10 ms - the time depends on the size of your display, the used interface, your application and your personal feeling. For a 4x20 LCD in 4 bit mode connected
// serially, I would recommend to use 1 ms, but this also depends on the update rate of your screen content. Beside from the interrupt function, this library has
// one other major function to write a string to the position you like and it also offers a few basic functions to output some data. Anyway, for more sophisticated
// string editing, I would recommend to use sprintf and pass the string to to this library.


// ########## INCLUDE THE HEADER FILE FOR THE USED PROCESSOR #################################################################################################################
//                                                                                                                                                                           #
#include "msp430fr5994.h"                                   // Controller specific header file                                                                                #
//                                                                                                                                                                           #
// ###########################################################################################################################################################################


// ########## MAKE A SELECTION: Define your used display type ################################################################################################################
//                                                                                                                                                                           #
//#define HD44780_TYPE_1x8                                 // LCD has 1 line with 8 characters                                                                               #
//#define HD44780_TYPE_1x16                                // LCD has 1 line with 16 characters                                                                              #
//#define HD44780_TYPE_1x20                                // LCD has 1 line with 20 characters                                                                              #
//#define HD44780_TYPE_2x8                                 // LCD has 2 lines with 8 characters each                                                                         #
#define HD44780_TYPE_2x16                                // LCD has 2 lines with 16 characters each                                                                        #
//#define HD44780_TYPE_2x20                                // LCD has 2 lines with 20 characters each                                                                        #
//#define HD44780_TYPE_4x16                                // LCD has 4 lines with 16 characters each                                                                        #
//#define HD44780_TYPE_4x20                                  // LCD has 4 lines with 20 characters each                                                                        #
//                                                                                                                                                                           #
// ###########################################################################################################################################################################


// ########## MAKE A SELECTION: Define whether you use a parallel or serial interface ########################################################################################
//                                                                                                                                                                           #
#define HD44780_PARALLEL_MODE                              // HD44780 is used with a parallel interface                                                                      #
//#define HD44780_SERIAL_MODE                              // HD44780 is used with a serial interface via a shift register like the 74HCT595 or 74HCT164                     #
//                                                                                                                                                                           #
// ###########################################################################################################################################################################


// ########## MAKE A SELECTION: Define whether you use 4 bit or 8 bit mode ###################################################################################################
//                                                                                                                                                                           #
#define HD44780_8BIT_MODE                                  // HD44780 is used in 8 bit mode                                                                                  #
//#define HD44780_4BIT_MODE                                // HD44780 is used in 4 bit mode                                                                                  #
//                                                                                                                                                                           #
// ###########################################################################################################################################################################


// ########## MAKE A SELECTION: Define whether data lines of HD44780 are connected in consecutive order to MCU or shift register or if mixed ports / pins are used ###########
//                                                                                                                                                                           #
#define HD44780_CONSECUTIVE_PINS_MODE                      // D0 to D7 / D4 to D7 (8 / 4 bit) of HD44780 connected in consecutive order to MCU or shift register             #
//#define HD44780_MIXED_PINS_MODE                          // D0 to D7 / D4 to D7 (8 / 4 bit) of HD44780 connected to mixed ports / pins of MCU or shift register            #
//                                                                                                                                                                           #
// Info:                                                                                                                                                                     #
// Allowed connections for consecutive 8 bit mode are D0 to D7 of HD44780 consecutively connected to Px.0 to Px.7 of one single port of MCU or to output Q0 to Q7 of shift   #
// register. For consecutive 4 bit mode connect D4 to D7 of HD44780 consecutively to either Px.0 to Px.3 or to Px.4 to Px.7 of one single port of MCU or to either Q0 to Q3  #
// or Q4 to Q7 of shift register. Any consecutive connections in between like Px.2 to Px.5 or Q3 to Q6 are not allowed - use mixed mode in this case. In mixed mode you can  #
// use any port and any pin of the MCU for any D0 to D7 (8 bit) or any D4 to D7 (4 bit) data line of the HD44780. Q0 to Q7 of a shift register can be mixed in any           #
// combination as well.                                                                                                                                                      #
// ###########################################################################################################################################################################


// ########## INSERT YOUR CONFIGURATION: Define the hardware connection for ENABLE of HD44780 ################################################################################
//                                                                                                                                                                           #
#define HD44780_ENABLE_MCU_OUT_PORT         P2OUT          // Define MCU output port that is connected to ENABLE of HD44780                                                  #
#define HD44780_ENABLE_MCU_OUT_PIN          BIT0           // Define MCU output pin that is connected to ENABLE of HD44780                                                   #
//#define HD44780_ENABLE_INVERTED                          // Enable if signal for ENABLE is inverted by external hardware                                                   #
//                                                                                                                                                                           #
// ###########################################################################################################################################################################

#ifdef HD44780_PARALLEL_MODE // Don't touch

