gibbs212521/HEC_2_senior_design/Firmware/MSP430fr5994_MCU/Includes/lcd.h
// ########## INSERT YOUR CONFIGURATION: Define the hardware connection for RS of HD44780 ####################################################################################
//                                                                                                                                                                           #
#define HD44780_RS_MCU_OUT_PORT             P2OUT          // Define MCU output port that is connected to RS of HD44780                                                      #
#define HD44780_RS_MCU_OUT_PIN              BIT1           // Define MCU output pin that is connected to RS of HD44780                                                       #
//#define HD44780_RS_INVERTED                              // Enable if signal for RS is inverted by external hardware                                                       #
//                                                                                                                                                                           #
// ###########################################################################################################################################################################

#ifdef HD44780_CONSECUTIVE_PINS_MODE // Don't touch

// ########## INSERT YOUR CONFIGURATION: Define the port of the MCU that the HD44780 is connected to #########################################################################
//                                                                                                                                                                           #
#define HD44780_MCU_OUT_PORT                P1OUT          // Define MCU output port that is connected to HD44780                                                            #
//                                                                                                                                                                           #
// ###########################################################################################################################################################################

#ifdef HD44780_4BIT_MODE // Don't touch

// ########## MAKE A SELECTION: DB4 to DB7 of HD44780 connected to lower (Px.0 to Px.3) or higher (Px.4 to Px.7) nibble of MCU port ##########################################
//                                                                                                                                                                           #
//#define HD44780_4BIT_MCU_LOWER_NIBBLE                    // D4 to D7 of HD44780 is connected to Px.0 to Px.3 of MCU port                                                   #
#define HD44780_4BIT_MCU_HIGHER_NIBBLE                     // D4 to D7 of HD44780 is connected to Px.4 to Px.7 of MCU port                                                   #
//                                                                                                                                                                           #
// ###########################################################################################################################################################################

#endif // Don't touch
#else // Don't touch
#ifdef HD44780_8BIT_MODE // Don't touch

// ########## INSERT YOUR CONFIGURATION: Define the hardware connections for D0 to D3 of HD44780 #############################################################################
//                                                                                                                                                                           #
#define HD44780_D0_MCU_OUT_PORT            P1OUT           // Define MCU output port that is connected to DB0 of HD44780                                                     #
#define HD44780_D0_MCU_OUT_PIN             BIT0            // Define MCU output pin that is connected to DB0 of HD44780                                                      #
//#define HD44780_D0_INVERTED                              // Enable if signal for D0 is inverted by external hardware                                                       #
//                                                                                                                                                                           #
#define HD44780_D1_MCU_OUT_PORT            P1OUT           // Define MCU output port that is connected to DB1 of HD44780                                                     #
#define HD44780_D1_MCU_OUT_PIN             BIT1            // Define MCU output pin that is connected to DB1 of HD44780                                                      #
//#define HD44780_D1_INVERTED                              // Enable if signal for D1 is inverted by external hardware                                                       #
//                                                                                                                                                                           #
#define HD44780_D2_MCU_OUT_PORT            P1OUT           // Define MCU output port that is connected to DB2 of HD44780                                                     #
#define HD44780_D2_MCU_OUT_PIN             BIT2            // Define MCU output pin that is connected to DB2 of HD44780                                                      #
//#define HD44780_D2_INVERTED                              // Enable if signal for D2 is inverted by external hardware                                                       #
//                                                                                                                                                                           #
#define HD44780_D3_MCU_OUT_PORT            P1OUT           // Define MCU output port that is connected to DB3 of HD44780                                                     #
#define HD44780_D3_MCU_OUT_PIN             BIT3            // Define MCU output pin that is connected to DB3 of HD44780                                                      #
//#define HD44780_D3_INVERTED                              // Enable if signal for D3 is inverted by external hardware                                                       #
//                                                                                                                                                                           #
// ###########################################################################################################################################################################

#endif // Don't touch

// ########## INSERT YOUR CONFIGURATION: Define the hardware connections for D4 to D7 of HD44780 #############################################################################
//                                                                                                                                                                           #
#define HD44780_D4_MCU_OUT_PORT            P1OUT           // Define MCU output port that is connected to DB4 of HD44780                                                     #
#define HD44780_D4_MCU_OUT_PIN             BIT1            // Define MCU output pin that is connected to DB4 of HD44780                                                      #
//#define HD44780_D4_INVERTED                              // Enable if signal for D4 is inverted by external hardware                                                       #
//                                                                                                                                                                           #
#define HD44780_D5_MCU_OUT_PORT            P1OUT           // Define MCU output port that is connected to DB5 of HD44780                                                     #
#define HD44780_D5_MCU_OUT_PIN             BIT2            // Define MCU output pin that is connected to DB5 of HD44780                                                      #
//#define HD44780_D5_INVERTED                              // Enable if signal for D5 is inverted by external hardware                                                       #
//                                                                                                                                                                           #
#define HD44780_D6_MCU_OUT_PORT            P1OUT           // Define MCU output port that is connected to DB6 of HD44780                                                     #
#define HD44780_D6_MCU_OUT_PIN             BIT6            // Define MCU output pin that is connected to DB6 of HD44780                                                      #
//#define HD44780_D6_INVERTED                              // Enable if signal for D6 is inverted by external hardware                                                       #
//                                                                                                                                                                           #
#define HD44780_D7_MCU_OUT_PORT            P1OUT           // Define MCU output port that is connected to DB7 of HD44780                                                     #
#define HD44780_D7_MCU_OUT_PIN             BIT7            // Define MCU output pin that is connected to DB7 of HD44780                                                      #
//#define HD44780_D7_INVERTED                              // Enable if signal for D7 is inverted by external hardware                                                       #
//                                                                                                                                                                           #
// ###########################################################################################################################################################################

#endif // Don't touch
#else // Don't touch

