gibbs212521/HEC_2_senior_design/Firmware/MSP430fr5994_MCU/Includes/lcd.h
// ########## MAKE A SELECTION: Define your used shift register type #########################################################################################################
//                                                                                                                                                                           #
//#define HD44780_SR_TYPE_595                              // Shift register type 74HCT595 is used                                                                           #
#define HD44780_SR_TYPE_164                                // Shift register type 74HCT164 is used                                                                           #
//                                                                                                                                                                           #
// ###########################################################################################################################################################################


// ########## INSERT YOUR CONFIGURATION: Define the hardware connections for CLOCK and DATA of the shift register ############################################################
//                                                                                                                                                                           #
#define HD44780_SR_CLK_MCU_OUT_PORT         P1OUT          // Define MCU output port that is connected to CLK of shift register                                              #
#define HD44780_SR_CLK_MCU_OUT_PIN          BIT0           // Define MCU output pin that is connected to CLK of shift register                                               #
//#define HD44780_SR_CLK_INVERTED                          // Enable if signal for CLOCK is inverted by external hardware                                                    #
//                                                                                                                                                                           #
#define HD44780_SR_DIN_MCU_OUT_PORT         P1OUT          // Define MCU output port that is connected to DIN of shift register                                              #
#define HD44780_SR_DIN_MCU_OUT_PIN          BIT1           // Define MCU output pin that is connected to DIN of shift register                                               #
//#define HD44780_SR_DIN_INVERTED                          // Enable if signal for DATA is inverted by external hardware                                                     #
//                                                                                                                                                                           #
// ###########################################################################################################################################################################

#ifdef HD44780_SR_TYPE_595 // Don't touch

// ########## INSERT YOUR CONFIGURATION: Define the hardware connection for LATCH of the shift register ######################################################################
//                                                                                                                                                                           #
#define HD44780_SR_LAT_MCU_OUT_PORT         P1OUT          // Define MCU output port that is connected to LATCH of shift register                                            #
#define HD44780_SR_LAT_MCU_OUT_PIN          BIT2           // Define MCU output pin that is connected to LATCH of shift register                                             #
//#define HD44780_SR_LAT_INVERTED                          // Enable if signal for LATCH is inverted by external hardware                                                    #
//                                                                                                                                                                           #
// ###########################################################################################################################################################################

#endif // Don't touch
#ifdef HD44780_CONSECUTIVE_PINS_MODE // Don't touch
#ifdef HD44780_4BIT_MODE // Don't touch

// ########## MAKE A SELECTION: DB4 to DB7 of HD44780 connected to lower (Q0 to Q3) or higher (Q4 to Q7) nibble of shift register ############################################
//                                                                                                                                                                           #
//#define HD44780_4BIT_SR_LOWER_NIBBLE                     // DB4 to DB7 of HD44780 is connected to Q0 to Q3 of shift register                                               #
#define HD44780_4BIT_SR_HIGHER_NIBBLE                      // DB4 to DB7 of HD44780 is connected to Q4 to Q7 of shift register                                               #
//                                                                                                                                                                           #
// ###########################################################################################################################################################################

#endif // Don't touch
#else
#ifdef HD44780_8BIT_MODE // Don't touch

// ########## INSERT YOUR CONFIGURATION: Define the hardware connections for DB0 to DB3 of HD44780 ###########################################################################
//                                                                                                                                                                           #
#define HD44780_D0_SR_PIN                  BIT0            // Define shift register pin that is connected to DB0 of HD44780                                                  #
//#define HD44780_D0_INVERTED                              // Enable if signal for D0 is inverted by external hardware                                                       #
//                                                                                                                                                                           #
#define HD44780_D1_SR_PIN                  BIT1            // Define shift register pin that is connected to DB1 of HD44780                                                  #
//#define HD44780_D1_INVERTED                              // Enable if signal for D1 is inverted by external hardware                                                       #
//                                                                                                                                                                           #
#define HD44780_D2_SR_PIN                  BIT2            // Define shift register pin that is connected to DB2 of HD44780                                                  #
//#define HD44780_D2_INVERTED                              // Enable if signal for D2 is inverted by external hardware                                                       #
//                                                                                                                                                                           #
#define HD44780_D3_SR_PIN                  BIT3            // Define shift register pin that is connected to DB3 of HD44780                                                  #
//#define HD44780_D3_INVERTED                              // Enable if signal for D3 is inverted by external hardware                                                       #
//                                                                                                                                                                           #
// ###########################################################################################################################################################################

#endif // Don't touch

// ########## INSERT YOUR CONFIGURATION: Define the hardware connections for DB4 to DB7 of HD44780 ###########################################################################
//                                                                                                                                                                           #
#define HD44780_D4_SR_PIN                  BIT4            // Define shift register pin that is connected to DB4 of HD44780                                                  #
//#define HD44780_D4_INVERTED                              // Enable if signal for D4 is inverted by external hardware                                                       #
//                                                                                                                                                                           #
#define HD44780_D5_SR_PIN                  BIT5            // Define shift register pin that is connected to DB5 of HD44780                                                  #
//#define HD44780_D5_INVERTED                              // Enable if signal for D5 is inverted by external hardware                                                       #
//                                                                                                                                                                           #
#define HD44780_D6_SR_PIN                  BIT6            // Define shift register pin that is connected to DB6 of HD44780                                                  #
//#define HD44780_D6_INVERTED                              // Enable if signal for D6 is inverted by external hardware                                                       #
//                                                                                                                                                                           #
#define HD44780_D7_SR_PIN                  BIT7            // Define shift register pin that is connected to DB7 of HD44780                                                  #
//#define HD44780_D7_INVERTED                              // Enable if signal for D7 is inverted by external hardware                                                       #
//                                                                                                                                                                           #
// ###########################################################################################################################################################################

#endif // Don't touch
#ifdef HD44780_4BIT_MODE  // Don't touch

// ########## MAKE A SELECTION: HD44780 RS pin driven by shift register or by GPIO of MCU ####################################################################################
//                                                                                                                                                                           #
//#define HD44780_RS_PIN_BY_SR                             // HD44780 RS pin is driven by shift register                                                                     #
#define HD44780_RS_PIN_BY_GPIO                             // HD44780 RS pin is driven by GPIO of MCU                                                                        #
//                                                                                                                                                                           #
// ###########################################################################################################################################################################


// ########## MAKE A SELECTION: HD44780 RS pin driven by shift register or by GPIO of MCU ####################################################################################
//                                                                                                                                                                           #
#define HD44780_SR_ONLY_FOR_DISPLAY                        // Shift register drives only HD44780 display and unused outputs are don't care                                   #
//#define HD44780_SR_SHARES_OTHER_FUNCTION                 // Shift register outputs not used by HD44780 have additional function                                            #
//                                                                                                                                                                           #
// ###########################################################################################################################################################################

#endif // Don't touch
#ifdef HD44780_RS_PIN_BY_SR // Don't touch

