gibbs212521/HEC_2_senior_design/Firmware/MSP430fr5994_MCU/Includes/lcd.h
// ########## INSERT YOUR CONFIGURATION: Define the hardware connection for RS of HD44780 ####################################################################################
//                                                                                                                                                                           #
#define HD44780_RS_SR_PIN                   BIT4           // Define shift register pin that is connected to RS of HD44780                                                   #
//#define HD44780_RS_INVERTED                              // Enable if signal for RS is inverted by external hardware                                                       #
//                                                                                                                                                                           #
// ###########################################################################################################################################################################

#else // Don't touch

// ########## INSERT YOUR CONFIGURATION: Define the hardware connection for RS of HD44780 ####################################################################################
//                                                                                                                                                                           #
#define HD44780_RS_MCU_OUT_PORT             P2OUT          // Define MCU output port that is connected to RS of HD44780                                                      #
#define HD44780_RS_MCU_OUT_PIN              BIT1           // Define MCU output pin that is connected to RS of HD44780                                                       #
//#define HD44780_RS_INVERTED                              // Enable if signal for RS is inverted by external hardware                                                       #
//                                                                                                                                                                           #
// ###########################################################################################################################################################################

#endif // Don't touch
#endif // Don't touch


// CONFIGURATION FINISHED


#define CR_LF           1
#define NO_CR_LF        0

#define SHOW_ZEROES     0
#define BLANK_ZEROES    1
#define DELETE_ZEROES   2


// ########## INTERRUPT FUNCTION: Place this function inside a timer interrupt that is called every 1 ms to 10 ms ############################################################
//                                                                                                                                                                           #
void hd44780_timer_isr( void ); //                                                                                                                                           #
//                                                                                                                                                                           #
// ###########################################################################################################################################################################


// ########## uint8_t hd44780_write_string( char * ch__string, uint8_t u8__row, uint8_t u8__column, uint8_t u8__cr_lf ) ######################################################
//                                                                                                                                                                           #
// Info: Places a text string at the desired location on the display                                                                                                         #
//                                                                                                                                                                           #
uint8_t hd44780_write_string( char * ch__string, uint8_t u8__row, uint8_t u8__column, uint8_t u8__cr_lf ); //                                                                #
//                                                                                                                                                                           #
// Function arguments:                                                                                                                                                       #
// -------------------                                                                                                                                                       #
// char * ch__string : Pointer to a text string that is terminated with 0 ('\0')                                                                                             #
// uint8_t u8__row   : Row where the string shall be written to - number must be within display, otherwise it is ignored - starting from 1                                   #
// uint8_t u8__column: Column where the string shall start - number must be within display, otherwise it is ignored - starting from 1                                        #
// uint8_t u8__cr_lf : 0 or NO_CR_LF for stop printing at end of row, 1 or CR_LF to continue printing in next line (or from beginning in single row display)                 #
//                                                                                                                                                                           #
// Return value:                                                                                                                                                             #
// -------------                                                                                                                                                             #
// Returns last written column in row or 0 if row or column was out of range                                                                                                 #
// ###########################################################################################################################################################################


