gibbs212521/HEC_2_senior_design/Firmware/MSP430fr5994_MCU/Includes/lcd.h
// ########## void hd44780_clear_row( uint8_t u8__row ) ######################################################################################################################
//                                                                                                                                                                           #
// Info: Clears a single row of the display                                                                                                                                  #
//                                                                                                                                                                           #
void hd44780_clear_row( uint8_t u8__row ); //                                                                                                                                #
//                                                                                                                                                                           #
// Function argument:                                                                                                                                                        #
// ------------------                                                                                                                                                        #
// uint8_t u8__row  : Row that shall be cleared - number must be within display, otherwise it is ignored - starting from 1                                                   #
// ###########################################################################################################################################################################


// ########## void hd44780_clear_screen( void ) ##############################################################################################################################
//                                                                                                                                                                           #
// Info: Clears the complete screen                                                                                                                                          #
//                                                                                                                                                                           #
void hd44780_clear_screen( void ); //                                                                                                                                        #
//                                                                                                                                                                           #
// ###########################################################################################################################################################################


// ########## void hd44780_blank_out_remaining_row( uint8_t u8__row, uint8_t u8__column ) ####################################################################################
//                                                                                                                                                                           #
// Info: Blanks out remaining columns of a row - useful if new text is shorter than old text since columns still contain the old information                                 #
//                                                                                                                                                                           #
void hd44780_blank_out_remaining_row( uint8_t u8__row, uint8_t u8__column );//                                                                                               #
//                                                                                                                                                                           #
// Function arguments:                                                                                                                                                       #
// -------------------                                                                                                                                                       #
// uint8_t u8__row   : Row where columns shall be blanked out - number must be within display, otherwise it is ignored - starting from 1                                     #
// uint8_t u8__column: Column where blanking out shall start - number must be within display, otherwise it is ignored - starting from 1                                      #
// ###########################################################################################################################################################################


// ########## void hd44780_write_shared_shift_register_bits( uint8_t u8__sr_bitmap ) #########################################################################################
//                                                                                                                                                                           #
// Info: Updates the logic level of shift register outputs that are not used for display communication in 4 bit serial mode                                                  #
//                                                                                                                                                                           #
void hd44780_write_shared_shift_register_bits( uint8_t u8__sr_bitmap ); //                                                                                                   #
//                                                                                                                                                                           #
// Function arguments:                                                                                                                                                       #
// ----------------------                                                                                                                                                    #
// uint8_t u8__sr_bitmap: Logic state of shift register outputs that are not used for display communication - update rate is timer interval                                  #
// ###########################################################################################################################################################################


// ########## uint8_t hd44780_output_adc_value_mv( uint32_t u32__adc_value, uint16_t u16__adc_reference_mv, uint8_t u8__adc_resolution_bits, #################################
//                                                 uint8_t u8__leading_zero_handling, uint8_t u8__row, uint8_t u8__column, uint8_t u8__cr_lf )                               #
//                                                                                                                                                                           #
// Info: Outputs a sampled ADC voltage based on the ADC result, the reference voltage and the resolution at the desired display location                                     #
//                                                                                                                                                                           #
uint8_t hd44780_output_adc_value_mv( uint32_t u32__adc_value, uint16_t u16__adc_reference_mv, uint8_t u8__adc_resolution_bits, uint8_t u8__leading_zero_handling, //         #
                                     uint8_t u8__row, uint8_t u8__column, uint8_t u8__cr_lf );                                                                    //         #
//                                                                                                                                                                           #
// Function arguments:                                                                                                                                                       #
// ----------------------------------                                                                                                                                        #
// uint32_t u32__adc_value          : ADC result                                                                                                                             #
// uint16_t u16__adc_reference_mv   : The ADC's reference voltage                                                                                                            #
// uint8_t u8__adc_resolution_bits  : ADC resolution in bits                                                                                                                 #
// uint8_t u8__leading_zero_handling: Pass 0 or SHOW_ZEROES to print zeroes, 1 or BLANK_ZEROES to blank them out, 2 or DELETE_ZEROES for deleting them                       #
// uint8_t u8__row                  : Row where the value shall be written to - number must be within display, otherwise it is ignored - starting from 1                     #
// uint8_t u8__column               : Column where the value shall start - number must be within display, otherwise it is ignored - starting from 1                          #
// uint8_t u8__cr_lf                : 0 or NO_CR_LF for stop printing at end of row, 1 or CR_LF to continue printing in next line (or from beginning in single row display)  #
// ###########################################################################################################################################################################


// ########## uint8_t hd44780_output_unsigned_16bit_value( uint16_t u16__value, uint8_t u8__leading_zero_handling, uint8_t u8__row, uint8_t u8__column, uint8_t u8__cr_lf ) ##
//                                                                                                                                                                           #
// Info: Outputs an unsigned 16 bit integer value at the desired display location                                                                                            #
//                                                                                                                                                                           #
uint8_t hd44780_output_unsigned_16bit_value( uint16_t u16__value, uint8_t u8__leading_zero_handling, uint8_t u8__row, uint8_t u8__column, uint8_t u8__cr_lf ); //            #
//                                                                                                                                                                           #
// Function arguments:                                                                                                                                                       #
// ----------------------------------                                                                                                                                        #
// uint16_t u16__value              : Unsigned 16 bit integer value                                                                                                          #
// uint8_t u8__leading_zero_handling: Pass 0 or SHOW_ZEROES to print zeroes, 1 or BLANK_ZEROES to blank them out, 2 or DELETE_ZEROES for deleting them                       #
// uint8_t u8__row                  : Row where the value shall be written to - number must be within display, otherwise it is ignored - starting from 1                     #
// uint8_t u8__column               : Column where the value shall start - number must be within display, otherwise it is ignored - starting from 1                          #
// uint8_t u8__cr_lf                : 0 or NO_CR_LF for stop printing at end of row, 1 or CR_LF to continue printing in next line (or from beginning in single row display)  #
// ###########################################################################################################################################################################

#endif /* HD44780_H_ */ // Don't touch
